# GetSizeTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..GetSizeTable Method
FamilySizeTableManager Class See Also
---
Get a FamilySizeTable by name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FamilySizeTable GetSizeTable(
	string tableName
)
```

Visual Basic
---
```text
Public Function GetSizeTable ( _
	tableName As String _
) As FamilySizeTable
```

Visual C++
---
```text
public:
FamilySizeTable^ GetSizeTable(
	String^ tableName
)
```

# ### Parameters
tableName
    Type: System..::..String The FamilySizeTable name.
# ### Return Value
The FamilySizeTable of a given name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace